models/admin/UserModel.php

	public static function findIdentity($id) {
// 		$user = self::find()
// 		->where([
// 				"id" => $id
// 		])
// 		->one();
// 		if (!count($user)) {
// 			return null;
// 		}
// 		return new static($user);

		return static::find()->where(['id'=>$id])->one();
---
SELECT * FROM `nobi_user` WHERE `id`=1