controllers/admin/CategoryController.php

    public function actionIndex() {
        $query = Category::find ()
                ->where (['status' => '1'])
                ->andWhere('depth > 0');


        $getName = Yii::$app->request->get ('g_name', '' );
        if($getName != ''){
            $query->innerJoinwith('category_detail')->andWhere('nobi_category_detail.name like :name',[':name'=> '%'.$getName.'%']);
        }

        $countQuery = clone $query;
        $pages = new Pagination ( [
                'totalCount' => $countQuery->count (),
                'pageSize' => 10
        ] );

        $the_category = $query
        ->orderBy ( 'nobi_category.lft' )
        ->offset ( $pages->offset )
        ->limit ( $pages->limit )
        ->with ( [
                    'category_detail' => function ($query) {
                        $query->andWhere ( [
                                'lang_id' => '1'
                        ]);
                    },

                    'user_created' => function ($query) {
                        $query->select ( [
                                'id',
                                'username'
                        ] );
                    }
                ] )
        ->asArray()
        ->all ();
---
SELECT COUNT(*) FROM `nobi_category` INNER JOIN `nobi_category_detail` ON `nobi_category`.`id` = `nobi_category_detail`.`cate_id` WHERE (`status`='1') AND (depth > 0) AND (nobi_category_detail.name like '%c%')