controllers/admin/DefaultController.php

UPDATE `nobi_user` SET `language`='vi' WHERE `id`=1
---
    public function actionSelectLang($lang = 'vi')
    {
        if (in_array($lang, Yii::$app->params['active_languages'])) {
            if (Yii::$app->user->isGuest) {
                Yii::$app->session->set('active_language', $lang);
            } else {
                // Yii::$app->session->set('active_language', $lang);
                Yii::$app->db->createCommand()->update('nobi_user', ['language'=>$lang], ['id'=>MY_ID])->execute();