controllers/admin/MyController.php

INSERT INTO `nobi_log` (`u_id`, `action`, `created_at`, `result`) VALUES (4, 'Created user id :5', '2018-02-01 07:11:17', 1)
---
	public function actionSavelog($action, $result){
		Yii::$app->db->createCommand()
		->insert('nobi_log', [
				'u_id'=> USER_ID,
				'action' => $action,
				'created_at' => NOW,
				'result' => $result,
		])
		->execute();