controllers/admin/PostController.php

SELECT * FROM `nobi_category_detail` WHERE (`lang_id`='1') AND (`cate_id`='2')
SELECT * FROM `nobi_post_detail` WHERE (`lang_id`='1') AND (`post_id` IN ('1', '2', '3', '4'))
---
    public function actionIndex() {
        $query = PostModel::find ()->where ( [
                'status' => '1'
        ] );

        $getName = Yii::$app->request->get ('g_name', '' );

        if($getName != ''){
            $query->innerJoinwith('post_detail')->andWhere('name like :name',[':name'=> '%'.$getName.'%']);
        }

        $countQuery = clone $query;
        $pages = new Pagination ( [
                'totalCount' => $countQuery->count (),
                'pageSize' => 10
        ] );

        $the_post = $query
            ->orderBy ( 'nobi_post.id' )
            ->offset ( $pages->offset )
            ->limit ( $pages->limit )
            ->with ( [
                'post_detail' => function ($query) {
                    $query->andWhere ( [
                            'lang_id' => '1'
                    ]);

                },

                'category_detail' => function ($query) {
                    $query->andWhere ( [
                            'lang_id' => '1'
                    ] );
                },
                'user_created' => function ($query) {
                    $query->select ( [
                            'id',
                            'username'
                    ] );
                }
        ] )
        ->asArray()
        ->all ();