controllers/admin/SlideController.php

    public function actionIndex() {
        $query = Slide::find ()
                ->where (['status' => '1'])
                ->andWhere('depth > 0');


        $getName = Yii::$app->request->get ('g_name', '' );
        if($getName != ''){
            $query->innerJoinwith('slide_detail')->andWhere('nobi_slide_detail.name like :name',[':name'=> '%'.$getName.'%']);
        }

        $countQuery = clone $query;
        $pages = new Pagination ( [
                'totalCount' => $countQuery->count (),
                'pageSize' => 10
        ] );

        $the_Slide = $query
        ->orderBy ( 'nobi_Slide.lft' )
        ->offset ( $pages->offset )
        ->limit ( $pages->limit )
        ->with ( [
                    'slide_detail' => function ($query) {
                        $query->andWhere ( [
                                'lang_id' => '1'
                        ]);
                    },

                    'user_created' => function ($query) {
                        $query->select ( [
                                'id',
                                'username'
                        ] );
                    }
                ] )
        ->asArray()
        ->all ();
---
SELECT COUNT(*) FROM `nobi_slide` INNER JOIN `nobi_slide_detail` ON `nobi_slide`.`id` = `nobi_slide_detail`.`cate_id` WHERE (`status`='1') AND (depth > 0) AND (nobi_slide_detail.name like '%a%')