controllers/admin/UserController.php

SELECT `id`, `permission_name` FROM `nobi_permission` WHERE `status`='1' ORDER BY `id`
INSERT INTO `nobi_user` (`username`, `password`, `f_name`, `l_name`, `gender`, `address`, `emails`, `id_permission`, `status_acc`, `created_at`, `created_by`, `updated_at`, `updated_by`, `avatar`) VALUES ('ádasd', '6cdac9d12232e9bc9718bc966453880en0b1', 's dá d', 'sad asd ', 0, 'sadasd sad', 'QWWWW@GMAIL.COM', 1, 2, '2018-02-01 07:11:17', 4, '2018-02-01 07:11:17', 4, 'upload/user/1.jpeg')
---
    public function actionC() {
        $theUser = new UserModel ();
        $theUser->scenario = 'create';

        $list_permission =  $query = PermissionModel::find ()
            ->select('id, permission_name')
            ->where ( [ 'status' => '1' ] )
            ->orderBy ( 'id' )
            ->asArray()
            ->all ();;

        if ($theUser->load ( Yii::$app->request->post () ) && $theUser->validate ()) {


            $theUser->created_at = NOW;
            $theUser->created_by = USER_ID;
            $theUser->updated_at = NOW;
            $theUser->updated_by = USER_ID;
            // $theUser->status_acc = 1;
            // $theUser->username = $theUser->username;
            // $theUser->f_name = $theUser->f_name;
            // $theUser->l_name = $theUser->l_name;
            // $theUser->emails = $theUser->emails;
            // $theUser->gender = $theUser->gender;
            $theUser->password = md5 ( $theUser->password ) . 'n0b1';

            $result = $theUser->save ( false );