controllers/HomeController.php

SELECT COUNT(*) FROM `nobi_category` WHERE (`status`='1') AND (depth > 0)
---
    public function actionIndex() {

        $query_category = Category::find ()->select('id, lft')->where (['status' => '1'])->andWhere('depth > 0');

        $countQuery_category = clone $query_category;
        $pages = new Pagination ( [
                'totalCount' => $countQuery_category->count (),
                'pageSize' => 10
        ] );

        $the_category = $query_category
        ->orderBy ( 'nobi_category.lft' )
        ->offset ( $pages->offset )
        ->limit ( $pages->limit )
        ->with ( [
                    'category_detail' => function ($query) {
                        $query->andWhere ( [
                                'lang_id' => '1'
                        ]);
                    },
                ] )
        ->asArray()
        ->all ();

SELECT * FROM `nobi_category_detail` WHERE (`lang_id`='1') AND (`cate_id`='2')
---
                    ]);
                },

                'category_detail' => function ($query) {
                    $query->andWhere ( [
                            'lang_id' => '1'
                    ] );
                },
                'user_created' => function ($query) {
                    $query->select ( [
                            'id',
                            'username'
                    ] );
                }
        ] )
        ->asArray()
        ->all ();